[   
    {
        "name": "Websites Manager for IOTA Solutions",
        "categories": ["Develop", "Entrepreneur"],
        "desciption": "<h3>Application Websites Manager</h3></br>    <p>       Durant mon alternance chez IOTA Solutions, J'ai créé Websites Manager pour surveiller les modifications sur les sites web des clients. Développée avec Next.js, Prisma         et PostgreSQL, l'application compare les pages à des références et envoie des alertes en cas de changements. Ce projet est         en première version et est conçu pour évoluer facilement grâce aux technologies choisies.    </p></br>    <h4>Compétences Mobilisées</h4></br>    <ul>        <li><strong>AC34.01</strong> : Utilisation de Next.js pour le développement côté client.</li>  <li><strong>AC34.02</strong> : Utilisation de Next.js, PostgreSQL et Prisma pour le développement des api et server actions</li> <li><strong>AC34.03</strong> : Développer des dispositifs interactifs sophistiqués : Création de fonctionnalités complexes.</li>     <li><strong>AC34.04</strong> : Développement de composants logiciels et scripts de scraping.</li>    </ul>",
        "images": [
            {
                "path": "/assets/images/projects/websites-manager/1.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/websites-manager/2.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/websites-manager/3.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/websites-manager/4.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/websites-manager/5.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/websites-manager/6.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/websites-manager/7.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/websites-manager/8.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/websites-manager/9.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/websites-manager/10.png",
                "alt": "Image du projet"
            }
        ]
    },
    {
        "name": "Installation de Airbyte sur VPS",
        "categories": ["Développer", "Entreprendre"],
        "desciption": "<h3>Résumé du Projet Airbyte</h3></br><p>Pour IOTA Solutions, j'ai configuré <strong>Airbyte</strong> sur un serveur VPS Ubuntu, utilisant <strong>Docker</strong> pour la gestion des conteneurs et <strong>Nginx</strong> pour sécuriser les connexions via <strong>Let’s Encrypt</strong>. Le monitoring a été assuré avec <strong>Datadog</strong>. Ce projet à ensuite permis d'extraire, transformer et charger des données vers Google <strong>BigQuery</strong> pour une analyse avancée, automatisant ainsi le traitement de données massives pour le client.</p></br><h4>Compétences mobilisées :</h4></br><ul>    <li><strong>AC34.02</strong> : Développement côté serveur avec Docker.</li>    <li><strong>AC34.05</strong> : Hébergement et déploiement d’applications.</li></ul>",
        "images" : [
            {
                "path": "/assets/images/projects/airbyte-install/1.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/airbyte-install/2.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/airbyte-install/3.webp",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/airbyte-install/4.webp",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/airbyte-install/5.png",
                "alt": "Image du projet"
            }
        ]
    },
    {
        "name": "Flux n8n pour Armand Heitz",
        "categories": ["Développer", "Entreprendre"],
        "desciption": " <h3>Projet d'automatisation avec n8n</h3></br>    <p>        Dans le cadre de mon alternance chez IOTA Solutions, j'ai conçu un flux d'automatisation avec n8n pour Armand Heitz,         un producteur viticole. Ce projet a permis de centraliser et d'automatiser la gestion des tâches répétitives,         améliorant ainsi l'efficacité opérationnelle. Le flux automatisé gère des processus tels que la récupération des commandes,         l'envoi d'alertes par e-mail en cas d'erreurs et l'intégration des données avec différentes plateformes.    </p></br>    <h4>Compétences Mobilisées</h4></br>    <ul>        <li><strong>AC34.03</strong> : Développer des dispositifs interactifs sophistiqués - Création de flux d'automatisation complexes avec n8n, intégration d’APIs, et gestion des erreurs.</li>        <li><strong>AC34.05</strong> : Maîtriser l’hébergement et le déploiement d’applications - Déploiement du flux sur un serveur de production sécurisé.</li>    </ul>",
        "images": [
            {
                "path": "/assets/images/projects/n8n-armand-heitz/1.png",
                "alt": "Image du projet"
            }
        ]
    },
    {
        "name": "Pokédex",
        "categories": ["Développer", "Entreprendre"],
        "desciption": "<h3>Projet : Création d'un Pokédex avec Next.js et Java Spring Boot</h3></br><p>J'ai conçu et développé un site web <strong>Pokédex</strong> en utilisant <strong>Next.js</strong>, permettant aux utilisateurs de parcourir une base de données de plus de 1000 Pokémon. Le site offre une interface réactive et dynamique, intégrant des fonctionnalités de recherche et de filtrage avancées pour améliorer l'expérience utilisateur.</p></br><p>    Pour alimenter ce site, j'ai développé une <strong>API REST</strong> en <strong>Java Spring Boot</strong>, qui gère l'ensemble des données Pokémon et dresseurs. Cette API est responsable de la communication entre le frontend et la base de données, assurant la fiabilité et la rapidité des échanges d'information.</p></br><p>    Les utilisateurs peuvent créer un compte, s'authentifier via un système sécurisé, puis créer un profil de dresseur. Une fois connectés, ils peuvent capturer des Pokémon et les ajouter à leur collection personnelle.</p></br><h4>Compétences mobilisées :</h4></br><ul>    <li><strong>AC34.01</strong> : Développement d'une interface web dynamique en Next.js.</li>    <li><strong>AC34.02</strong> : Développement d'API REST en Java Spring Boot.</li> <li><strong>AC34.04</strong> : Conception et Developpement de systèmes de filtres de recherches avancés</li> <li><strong>AC34.04</strong> : Création de composants réutilisables</li></ul>",
        "images" : [
            {
                "path": "/assets/images/projects/pokedex/5.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/pokedex/1.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/pokedex/2.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/pokedex/3.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/pokedex/4.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/pokedex/6.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/pokedex/7.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/pokedex/8.png",
                "alt": "Image du projet"
            }
        ]
    },
    {
        "name": "Iota-Solutions",
        "categories": ["Développer", "Entreprendre"],    
        "desciption": "<h3>Présentation de l'entreprise IOTA Solutions</h3></br>    <p>        IOTA Solutions, fondée en 2021 et basée à Couternon, en Bourgogne, est une SARL spécialisée dans l'édition de logiciels applicatifs.         L'entreprise propose des services variés tels que la création de sites web et d'e-commerce avec WordPress,         le développement d'applications sur mesure, l'hébergement, la maintenance, ainsi que des campagnes cross-média.         Elle accompagne également les entrepreneurs dans le lancement de leur entreprise, leur offrant des conseils stratégiques.    </p></br>    <p>        Dirigée par Alix Imbeaux (communication) et Romain Ollivier (développement technique),         IOTA Solutions valorise la proximité avec ses clients pour mieux répondre à leurs besoins.         En pleine croissance, l'entreprise se concentre aussi sur l'automatisation du marketing pour optimiser les processus commerciaux de ses clients.    </p>",
        "images" : [
            {
                "path": "/assets/images/projects/iota-solutions/1.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/iota-solutions/2.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/iota-solutions/3.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/iota-solutions/4.JPG",
                "alt": "Image du projet"
            }
        ]
    },
    {
        "name": "Brasserie fictive - À la table des nains",
        "categories": ["Développer", "Entreprendre"],
        "desciption": "  <h3>Projet Fictif Brasserie À la Table des Nains</h3></br>    <p>        Dans le cadre de notre BUT MMI, nous avons réalisé en groupe un projet fictif pour créer un site web, une application mobile, un clip vidéo, et organiser l'inauguration d'une brasserie-restaurant. L’objectif était de convaincre le client de choisir notre équipe parmi plusieurs concurrentes.    </p></br>    <p>        Je me suis particulièrement impliqué dans la création du site web et des affiches promotionnelles. J’ai également contribué à l’évaluation de l’éco-conception du projet et coordonné les échanges avec le client. Notre groupe a remis un document PDF détaillé et a présenté notre projet lors d'une soutenance, où nous avons défendu nos choix.    </p></br>    <h4>Compétences Développées :</h4></br>    <ul>        <li><strong>AC35.01 | Piloter un produit, un service ou une équipe :</strong> Gestion des tâches et coordination avec le client.</li>        <li><strong>AC35.02 | Maîtriser la qualité en projet Web ou multimédia :</strong> Conception et évaluation de la qualité.</li>        <li><strong>AC35.03 | Concevoir un projet d’entreprise innovante :</strong> Définition de l’identité du projet.</li>        <li><strong>AC35.04 | Défendre un projet de manière convaincante :</strong> Présentation et justification lors de la soutenance.</li>    </ul>",
        "images" : [
            {
                "path": "/assets/images/projects/brasserie-nains/1.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/brasserie-nains/2.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/brasserie-nains/3.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/brasserie-nains/4.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/brasserie-nains/5.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/brasserie-nains/6.png",
                "alt": "Image du projet"
            }
        ]
    },
    {
        "name": "Andre-delorme",
        "categories": ["Développer", "Entreprendre"],    
        "desciption": "Durant mon stage en tant que développeur Junior, j'ai eu l'opportunité de contribuer à la création d'un site e-commerce pour l'entreprise André-Delorme, spécialisée dans les vins. Mon objectif principal était de concevoir une plateforme en ligne conviviale permettant aux utilisateurs de découvrir et d'acheter facilement les vins proposés par l'entreprise. J'ai utilisé WordPress comme base pour construire le site e-commerce, en choisissant un thème très flexible permettant de m'adapté à l'identité visuelle d'André-Delorme. J'ai personnalisé l'apparence du site pour créer une expérience visuelle cohérente et attrayante pour les visiteurs.  Pour répondre aux besoins spécifiques d'André-Delorme, j'ai utilisé le plugin ACF (Advanced Custom Fields) afin d'ajouter des champs personnalisés aux différentes sections du site. Ces champs personnalisés permettaient au client de gérer facilement les informations relatives aux produits, telles que les caractéristiques des vins, les notes de dégustation et les informations de livraison. Ce projet m'a permis d'acquérir une expérience précieuse dans la création d'un site e-commerce fonctionnel et adapté aux besoins d'une entreprise spécifique. J'ai également appris à travailler de manière proffessionel en équipe tout en m'adpatant aux demandes et retours du client",
        "images" : [
            {
                "path": "/assets/images/projects/andre-delorme/1.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/andre-delorme/2.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/andre-delorme/3.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/andre-delorme/4.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/andre-delorme/5.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/andre-delorme/6.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/andre-delorme/7.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/andre-delorme/8.JPG",
                "alt": "Image du projet"
            }
        ]
    },
    {
        "name": "Sherlock Event",
        "categories": ["Développer"],    
        "desciption": "Le projet consiste en l'organisation et la communication d'un événement fictif sur le personnage de Sherlock Holmes prévu pour le 2 juin 2023 sur le campus de l'université de Dijon. Ce projet s'est déroulé en groupe, et nous avons été mené à concevoir des visuels attrayants et impactants pour promouvoir l'événement. On a créé des exemples de posts sur les réseaux sociaux, des lettres d'invitations pour les VIP et le public cible, des posters intrigants. Notre objectif était de capturer l'essence de Sherlock Holmes et de susciter l'enthousiasme chez les fans en utilisant des éléments visuels percutants. On a veillé à ce que tous les visuels créés soient en harmonie avec cette identité, en utilisant des couleurs, des typographies et des éléments graphiques spécifiques. Cela a permis de maintenir une cohérence visuelle tout au long de la communication et de renforcer la reconnaissance de l'événement. Nous avons également utilisé un diagramme de Gantt afin de détailler les étapes de notre plan de communication. Enfin, j'ai réalisé un site web dédié à l'événement, permettant aux participants d'acheter leurs tickets directement en ligne. Ce site offre une interface conviviale et intuitive, fournissant toutes les informations essentielles sur l'événement, les horaires, les tarifs et les activités proposées. Ce projet m'a permis de mettre en pratique mes compétences en gestion de projet, en création visuelle et en développement web",
        "images" : [
            {
                "path": "/assets/images/projects/sherlock/10.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/sherlock/11.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/sherlock/12.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/sherlock/13.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/sherlock/14.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/sherlock/15.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/sherlock/16.JPG",
                "alt": "Image du projet"
            }
        ]
    },
    {
        "name": "Visualisation de données",
        "categories": ["Développer"],    
        "desciption": "Le projet consiste à analyser un jeu de données qui représente les réponses d'un sondage mené auprès de la promotion MMI1 de l'IUT de Dijon. Les étudiants de première année ont été interrogés sur différents aspects de leurs goûts et de leur personnalité, notamment leurs goûts musicaux, cinématographiques, vestimentaires, scolaires, leur utilisation du temps libre, ainsi que quelques questions personnelles générales. L'objectif de ce projet était de dresser le portrait de la promotion MMI1 en utilisant les données recueillies. J'ai alors dû choisir des questions spécifiques à partir du jeu de données. J'ai ensuite produit différentes visualisations de données telles que des graphiques des pour illustrer mes analyses. Le projet s'est déroulé en plusieurs phases. Dans un premier temps, j'ai travaillé en groupe pour définir les questions auxquelles répondre avec le jeu de données. Ensuite, j'ai réalisé un site web en utilisant la librairie Plotly.js avec pour objectif de communiquer des faits intéressants sur la promotion MMI1.", 
        "images" : [
            {
                "path": "/assets/images/projects/visualisation-de-donnees/1.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/visualisation-de-donnees/2.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/visualisation-de-donnees/3.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/visualisation-de-donnees/4.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/visualisation-de-donnees/5.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/visualisation-de-donnees/6.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/visualisation-de-donnees/7.JPG",
                "alt": "Image du projet"
            }
        ]
    },
    {
        "name": "Site Dune",
        "categories": ["Développer"],    
        "desciption": "Ce projet consiste en la création d'un site vitrine sur l'univers de Dune. Le site web finalisé est composé de 6 slides accessibles via le burger button ou simplement au scroll. Au scroll, on retrouve un effet de parallaxe. Le but de ce projet était de développer mes compétences front-end. Pour cela, dans ce projet, j'ai appris les bases du JQuery afin d'être en capacité de l'utiliser si besoin. J'ai également utilisé de nombreuses API telles que celle de Youtube pour pouvoir placer la bande-annonce du film Dune en haut à droite lors du scroll, ou encore Leaflet afin de placer une carte dans laquelle on pouvait retrouver les cinémas près de notre localisation. De plus, afin de récupérer les cinémas, j'ai interagi avec un geojson en javascript. Finalement, la dernière slide a été créée en vue.js afin d'apprendre les bases de ce Framework pour être en mesure de, par la suite, créer un site entier en utilisant Vue.js.", 
        "images" : [
            {
                "path": "/assets/images/projects/dune/accueil.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/dune/p_deux.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/dune/p_trois.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/dune/p_quatre.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/dune/p_cinq.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/dune/p_six.JPG",
                "alt": "Image du projet"
            }
        ]
    },
    {
        "name": "Iliyan Stoyanov porfolio",
        "categories": ["Développer"],    
        "desciption": "J'ai réalisé ce projet afin d'aider un de mes collaborateurs : Iliyan Stoyanov. Pour la création de ce site web, j'ai suivi les wireframes qu'il avait au préalable créé ainsi qu'écouté ses directives et effectué des ajustements afin de perfectionner le site web et finalement lui produire le site qu'il souhaitait réellement.",   
        "images" : [
            {
                "path": "/assets/images/projects/iliyan/accueil.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/iliyan/about.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/iliyan/projets.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/iliyan/comp.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/iliyan/contact.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/iliyan/modal.png",
                "alt": "Image du projet"
            }
        ]
    },
    {
        "name": "Septieme Dommage",
        "categories": ["Développer"],    
        "desciption": "Ce projet est un site web réalisé durant le second semestre de ma formation. Pour ce projet de groupe, nous avons pris relation avec un commanditaire et obtenu un cahier des charges. Ce commanditaire est une association du jeu de cartes Final Fantazy cherchant à développer leur portée sur Internet. Ce projet impliquait d'abord la création d'une identité visuelle bien distincte pour notre commanditaire. Pour cela, nous avons réalisé une veille ainsi qu'un benchmark. Cette association possédant déjà une version grande et une version petite sur fond blanc de leur logo; nous les avons adaptés en créant plusieurs autres versions notamment sur fond sombre; nous avons également réglé les différents problèmes de contraste présents dans leurs premières versions de leur logo. Par la suite, nous avons réalisé un diagramme de Gantt pour organiser le développement du site. Ensuite, nous avons préparé notre environnement de travail sur wordpress, réalisé des wireframes et suivi notre plan. Finalement nous avons créé un mode d'emploi du site web afin d'aider le commanditaire à reprendre le site. Ce projet m'a permis de m'intégrer au sein d'une équipe tout en ayant une approche professionnelle",
        "images" : [
            {
                "path": "/assets/images/projects/septieme-dommage/pc.jpeg",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/septieme-dommage/accueil.jpg",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/septieme-dommage/blog.jpg",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/septieme-dommage/logo.jpg",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/septieme-dommage/charte_graphique.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/septieme-dommage/charte_web.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/septieme-dommage/mode_emploi.jpg",
                "alt": "Image du projet"
            }
        ]
    },
    {
        "name": "Concours photos",
        "categories": ["Développer"],    
        "desciption": "Le but de ce projet était de créer un site de création de concours. L'utilisateur ayant la possibilité de se connecter à son compte qu'il aurait enregistré précédemment. Avec ce compte, l'utilisateur pourrait organiser et participer à des concours ainsi que voter pour ceux-ci. Ce projet m'a permis d'apprendre les bases du back-end avec l'utilisation du php, de requêtes MySQL et d'une base de données. J'ai également progressé en CSS et j'ai appris à mieux organiser l'arborescence de mes fichiers.",
        "images" : [
            {
                "path": "/assets/images/projects/sae203/accueil.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/sae203/connexion.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/sae203/inscription.JPG",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/sae203/bdd.JPG",
                "alt": "Image du projet"
            }
        ]
    },
    {
        "name": "Mon premier site Web",
        "categories": ["Développer"],    
        "desciption": "Ce projet est un site web réalisé pendant le premier semestre de ma formation. L'objectif de celui-ci était l'apprentissage des bases de différents langages de programmation : HTML, CSS et JavaScript. Pour ce site web, j'avais des wireframes précis à respecter selon les différents appareils. J'ai donc réalisé ce site web en commençant par l'affichage sur smartphone portrait. Par la suite, j'ai réalisé l'affichage sur téléphone paysage, tablette portrait, tablette paysage et pc. Pour cela j'ai eu recours à des Media queries ( @media ) malgré l'utilisation d'unités responsives telles que le vh et vw. Ce projet a été pour moi, une bonne expérience. Il m'a permis d'apprendre non seulement les bases des languages précédemment cités mais aussi les normes dans ce domaine.",
        "images" : [
            {
                "path": "/assets/images/projects/first/tablette.png",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/first/tablette_portrait.jpg",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/first/phone.jpg",
                "alt": "Image du projet"
            },
            {
                "path": "/assets/images/projects/first/burger.jpg",
                "alt": "Image du projet"
            }
        ]
    }
]