{
    "Développer" : [
        {
            "ac" : "AC34.01",
            "label": "Développer à l’aide d’un framework de développement côté client",
            "status": "Acquis",
            "description" : "Durant cette année de formation, j'ai pu développer diverses sites web avec une des interfaces client en utilisant des frameworks de développement côté client. J'ai notamment utilisé Next.js lors de mon alternance ou même lors du projet Pokédex pour développer des sites web dynamiques et performants.",
            "link": "/my-work/pokedex"
        },
        {
            "ac" : "AC34.02",
            "label": "Développer à l’aide d’un framework de développement côté serveur",
            "status": "Acquis",
            "description" : "Durant cette année d'alternance chez IOTA Solutions, j'ai pu développer une application de gestion de sites en Next.js (Projet Websites Manager) dans laquelle j'ai conçu des API REST et des server actions en Node.js à l'aide de Prisma afin de pouvoir communiquer avec la base de données PostgreSQL.",
            "link": "/my-work/websites_manager_for_iota_solutions"
        },
        {
            "ac" : "AC34.03",
            "label": "Développer des dispositifs interactifs sophistiqués",
            "status": "Acquis",
            "description" : "Conception et Developpement de fonctionnalités complexe telles que des systèmes de filtres de recherches avancés réalisés côté backend en Java Spring Boot lors du Projet Pokédex conçu dans le cadre de la formation.", 
            "link": "/my-work/pokedex"
        },
        {
            "ac" : "AC34.04",
            "label": "Concevoir et développer des composants logiciels, plugins ou extensions",
            "status": "Acquis",
            "description" : "Comme dit précédemment, j'ai développé des applications en Next.js dans lesquelles j'ai conçu des composants réutilisables comme des 'cards', des boutons, des carrousels, et bien d'autres plus complexes comme des formulaires, des systèmes de filtres de recherches avancés et pagination ainsi que des systèmes de gestion de contenu dynamique.",
            "link": "/my-work/websites_manager_for_iota_solutions"
        },
        {
            "ac" : "AC34.05",
            "label": "Maitriser l’hébergement et le déploiement d’applications",
            "status": "Acquis",
            "description" : "Lors de mon alternance chez IOTA Solutions, j'ai été amené à déployer Airbyte sur un VPS Ubuntu. J'ai donc dû installer Docker et Docker-compose pour pouvoir déployer l'application. J'ai également dû configurer un reverse proxy avec Nginx pour pouvoir accéder à l'application via un nom de domaine. J'ai également dû configurer un certificat SSL pour sécuriser les échanges entre le client et le serveur.",
            "link": "/my-work/installation_de_airbyte_sur_vps"
        }
    ],

    "Entreprendre" : [
        {
            "ac" : "AC35.01",
            "label": "Piloter un produit, un service ou une équipe",
            "status": "Acquis",
            "description": "Durant cette année d'alternance chez IOTA Solutions, j'ai régulièrement participé à la gestion de projets. J'ai été impliqué activement dans le pilotage des projets, de la conception à la livraison. J'ai également pris part à des réunions avec les clients pour discuter des avancées réalisées.",
            "link": "/my-work/iota-solutions"
        },
        {
            "ac" : "AC35.02",
            "label": "Maîtriser la qualité en projet Web ou multimédia",
            "status": "Acquis",
            "description": "Lors de mon alternance chez IOTA Solutions, j'ai participé activement à la gestion et au développement de projets Web, en m'assurant de la qualité des livrables. J'ai utilisé BitBucket pour la gestion du code source, en appliquant des revues de code systématiques pour maintenir des standards élevés. ClickUp a été utilisé pour le suivi des tâches, la planification des sprints, et la gestion des délais. Ces outils m'ont permis de garantir un travail collaboratif efficace et de respecter les exigences techniques et fonctionnelles des projets.",
            "link": "/my-work/iota-solutions"
        },
        {
            "ac" : "AC35.03",
            "label": " Concevoir un projet d’entreprise innovante en définissant le nom, l’identité, la forme juridique et le ton de la marque",
            "status": "Acquis",
            "description" : "Au 5ème semestre de ma formation, j'ai participé à un projet de création d'entreprise. Nous avons créé une Brasserie fictive nommée 'À la table des nains'. On a défini le nom, l'identité, la forme juridique et le ton de la marque. Nous avons également réalisés des visuels pour la brasserie tels qu'un logo, des affiches et un site internet.",
            "link": "/my-work/a_la_table_des_nains"
        },
        {
            "ac" : "AC35.04",
            "label": "Défendre un projet de manière convaincante",
            "status": "Acquis",
            "description" : "Lors des rendez-vous avec les clients, j'ai su défendre les projets en présentant clairement nos choix et en justifiant nos décisions.",
            "link": "/my-work/iota-solutions"
        }
    ]
}